In [1]:
from typing import List, Dict
import numpy as np
import pandas as pd

A module that was compiled using NumPy 1.x cannot be run in
NumPy 2.1.2 as it may crash. To support both 1.x and 2.x
versions of NumPy, modules must be compiled with NumPy 2.0.
Some module may need to rebuild instead e.g. with 'pybind11>=2.12'.

If you are a user of the module, the easiest solution will be to
downgrade to 'numpy<2' or try to upgrade the affected module.
We expect that some modules will need time to support NumPy 2.

Traceback (most recent call last):  File "<frozen runpy>", line 198, in _run_module_as_main
  File "<frozen runpy>", line 88, in _run_code
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel_launcher.py", line 17, in <module>
    app.launch_new_instance()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/traitlets/config/application.py", line 1075, in launch_instance
    app.start()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelapp.py", line 701, in start
    self.io_loop.start()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/tornado/platform/asyncio.py", line 205, in start
    self.asyncio_loop.run_forever()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/asyncio/base_events.py", line 608, in run_forever
    self._run_once()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/asyncio/base_events.py", line 1936, in _run_once
    handle._run()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/asyncio/events.py", line 84, in _run
    self._context.run(self._callback, *self._args)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 534, in dispatch_queue
    await self.process_one()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 523, in process_one
    await dispatch(*args)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 429, in dispatch_shell
    await result
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 767, in execute_request
    reply_content = await reply_content
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/ipkernel.py", line 429, in do_execute
    res = shell.run_cell(
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/zmqshell.py", line 549, in run_cell
    return super().run_cell(*args, **kwargs)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3075, in run_cell
    result = self._run_cell(
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3130, in _run_cell
    result = runner(coro)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/async_helpers.py", line 128, in _pseudo_sync_runner
    coro.send(None)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3334, in run_cell_async
    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3517, in run_ast_nodes
    if await self.run_code(code, result, async_=asy):
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3577, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "/var/folders/kz/gdzfkm910wq4p613kw6rbgw40000gn/T/ipykernel_7983/2555707821.py", line 3, in <module>
    import pandas as pd
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/__init__.py", line 49, in <module>
    from pandas.core.api import (
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/api.py", line 28, in <module>
    from pandas.core.arrays import Categorical
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/arrays/__init__.py", line 1, in <module>
    from pandas.core.arrays.arrow import ArrowExtensionArray
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/arrays/arrow/__init__.py", line 5, in <module>
    from pandas.core.arrays.arrow.array import ArrowExtensionArray
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/arrays/arrow/array.py", line 50, in <module>
    from pandas.core import (
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/ops/__init__.py", line 8, in <module>
    from pandas.core.ops.array_ops import (
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/ops/array_ops.py", line 56, in <module>
    from pandas.core.computation import expressions
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/computation/expressions.py", line 21, in <module>
    from pandas.core.computation.check import NUMEXPR_INSTALLED
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/computation/check.py", line 5, in <module>
    ne = import_optional_dependency("numexpr", errors="warn")
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/compat/_optional.py", line 135, in import_optional_dependency
    module = importlib.import_module(name)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/importlib/__init__.py", line 126, in import_module
    return _bootstrap._gcd_import(name[level:], package, level)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/numexpr/__init__.py", line 24, in <module>
    from numexpr.interpreter import MAX_THREADS, use_vml, __BLOCK_SIZE1__

AttributeError: _ARRAY_API not found

A module that was compiled using NumPy 1.x cannot be run in
NumPy 2.1.2 as it may crash. To support both 1.x and 2.x
versions of NumPy, modules must be compiled with NumPy 2.0.
Some module may need to rebuild instead e.g. with 'pybind11>=2.12'.

If you are a user of the module, the easiest solution will be to
downgrade to 'numpy<2' or try to upgrade the affected module.
We expect that some modules will need time to support NumPy 2.

Traceback (most recent call last):  File "<frozen runpy>", line 198, in _run_module_as_main
  File "<frozen runpy>", line 88, in _run_code
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel_launcher.py", line 17, in <module>
    app.launch_new_instance()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/traitlets/config/application.py", line 1075, in launch_instance
    app.start()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelapp.py", line 701, in start
    self.io_loop.start()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/tornado/platform/asyncio.py", line 205, in start
    self.asyncio_loop.run_forever()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/asyncio/base_events.py", line 608, in run_forever
    self._run_once()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/asyncio/base_events.py", line 1936, in _run_once
    handle._run()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/asyncio/events.py", line 84, in _run
    self._context.run(self._callback, *self._args)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 534, in dispatch_queue
    await self.process_one()
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 523, in process_one
    await dispatch(*args)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 429, in dispatch_shell
    await result
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 767, in execute_request
    reply_content = await reply_content
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/ipkernel.py", line 429, in do_execute
    res = shell.run_cell(
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/ipykernel/zmqshell.py", line 549, in run_cell
    return super().run_cell(*args, **kwargs)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3075, in run_cell
    result = self._run_cell(
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3130, in _run_cell
    result = runner(coro)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/async_helpers.py", line 128, in _pseudo_sync_runner
    coro.send(None)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3334, in run_cell_async
    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3517, in run_ast_nodes
    if await self.run_code(code, result, async_=asy):
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/IPython/core/interactiveshell.py", line 3577, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "/var/folders/kz/gdzfkm910wq4p613kw6rbgw40000gn/T/ipykernel_7983/2555707821.py", line 3, in <module>
    import pandas as pd
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/__init__.py", line 49, in <module>
    from pandas.core.api import (
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/api.py", line 28, in <module>
    from pandas.core.arrays import Categorical
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/arrays/__init__.py", line 1, in <module>
    from pandas.core.arrays.arrow import ArrowExtensionArray
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/arrays/arrow/__init__.py", line 5, in <module>
    from pandas.core.arrays.arrow.array import ArrowExtensionArray
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/arrays/arrow/array.py", line 64, in <module>
    from pandas.core.arrays.masked import BaseMaskedArray
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/arrays/masked.py", line 60, in <module>
    from pandas.core import (
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/core/nanops.py", line 52, in <module>
    bn = import_optional_dependency("bottleneck", errors="warn")
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/pandas/compat/_optional.py", line 135, in import_optional_dependency
    module = importlib.import_module(name)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/importlib/__init__.py", line 126, in import_module
    return _bootstrap._gcd_import(name[level:], package, level)
  File "/Users/thomassullivan/opt/anaconda3/envs/analytics_zone/lib/python3.11/site-packages/bottleneck/__init__.py", line 7, in <module>
    from .move import (move_argmax, move_argmin, move_max, move_mean, move_median,

AttributeError: _ARRAY_API not found

In [2]:
#a pandas series is a one-dimensional array-like object
_obj : List[int] = [4, 7, -5, 3]

In [3]:
obj = pd.Series(_obj)
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
#string representation = series on the left, array on the right
obj.array #A NumpyExtensionArray or PandasArray creates an array that usually wraps
#numpy arrays and

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
#we can create a series with a data point identifying each object on the index
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
#we can use labels in the index in addition to numeric values
obj2["a"]

np.int64(-5)

In [9]:
obj2["d"] = 6

In [10]:
obj2 #the value is updated

d    6
b    7
a   -5
c    3
dtype: int64

In [11]:
#selecting individual values
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [12]:
obj2[list('cad')] #we can, if we really want to, create a list

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[[i for i in 'cad']] #we can also use a list comprehension

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2[test := [i for i in 'cad']] #we can assign a variable while creating an index

c    3
a   -5
d    6
dtype: int64

In [15]:
test

['c', 'a', 'd']

In [16]:
#we can use a boolean expression
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [17]:
#obj2 > 0 is a boolean type series
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [18]:
obj2 < 0

d    False
b    False
a     True
c    False
dtype: bool

In [19]:
(obj2 < 0) == (obj2 > 0)

d    False
b    False
a    False
c    False
dtype: bool

In [20]:
#multiply a series by two
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [21]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [22]:
#we can apply numpy.unfunc objects
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [23]:
#A series is like a fixed-length, ordered dictionary
sdata : Dict[str, int] = {'Ohio': 35000,
                         'Texas': 71000,
                         'Oregon': 16000,
                         'Utah': 5000}

In [24]:
obj3 = pd.Series(sdata)

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
#convert a series back to a dictionary with the ".to_dict()" method
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [27]:
#normally we have to use the key insertion order when we create a dataframe from a dictionary.
#if key N is added first, then it will appear first in the list
states: List[str] = ['California', 'Ohio', 'Oregon', 'Texas']

In [28]:
obj4 = pd.Series(sdata)
obj4

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
obj4 = pd.Series(sdata, index=states) #California is null because it there was no value for it
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
#isna and notna functions designate if a field is missing or not
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [31]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [32]:
pd.isna(obj4).any() == pd.notna(obj4).any()

np.True_

In [33]:
pd.notna(obj4)['California'] = True

In [34]:
pd.notna(obj4)['California']

np.False_

In [35]:
pd.notna(obj4)['California']

np.False_

In [36]:
pd.notna(obj4).astype(float)

California    0.0
Ohio          1.0
Oregon        1.0
Texas         1.0
dtype: float64

In [37]:
pd.notna(obj4).astype(int)

California    0
Ohio          1
Oregon        1
Texas         1
dtype: int64

In [38]:
#a series also has instance methods for the same thing
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [39]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [40]:
#series line up for things useful in arithmetic operations
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [41]:
testing_obj = obj3.copy()
testing_obj = testing_obj.reindex(['Ohio', 'Ohio', 'Texas', 'Oregon', 'Utah', 'Texas'],
                   ) #copies the value
testing_obj

Ohio      35000
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Texas     71000
dtype: int64

In [42]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [43]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [44]:
obj3 + obj4.fillna(0)

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [45]:
obj3.fillna(0) + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [46]:
obj3.fillna(0)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [47]:
obj4.fillna(0)

California        0.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [48]:
obj3 + (obj4.fillna(0))

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [49]:
(obj3.fillna(0)) + (obj4.fillna(0))

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [50]:
obj3.fillna(0) + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [51]:
(test1 := obj3.fillna(0)) + (test2 := obj4.fillna(0))

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [52]:
obj4.fillna(0)

California        0.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [53]:
#series object itself and its index have a name attribute
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [54]:
obj4.name = 'population'
obj4.index.name = 'state'

In [55]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [56]:
#Alter the index of a series in place: assign a new value
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [57]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [58]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [59]:
#Note: pandas can alter the index in place by assignment, but this does not
sdata2 : Dict[str, int] = {'Ohio': 35000,
                         'Texas': 71000,
                         'Oregon': 16000,
                         'Utah': 5000}

In [60]:
new_obj = pd.Series(sdata2)

In [61]:
new_obj

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [62]:
new_obj.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [63]:
new_obj.index = ['Texas', 'Oregon', 'Utah', 'Ohio']

In [64]:
new_obj #values don't change

Texas     35000
Oregon    71000
Utah      16000
Ohio       5000
dtype: int64

In [65]:
new_obj + obj4 #when we add them we match up on the labels

California         NaN
Ohio           40000.0
Oregon         87000.0
Texas         106000.0
Utah               NaN
dtype: float64

In [66]:
#DataFrame: a rectangular table of data consisting of columns, each of which has a different 
#value type
data : Dict[str, List[str | int | float]] = {
    'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

In [67]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [68]:
#first five rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [69]:
#first_n_rows
frame.head(4)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4

In [70]:
#first_n_rows
frame.head(n=4)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4

In [71]:
#last 5 rows
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [72]:
#last 8 rows
frame.tail(8)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [73]:
frame.set_index('state')

        year  pop
state
Ohio    2000  1.5
Ohio    2001  1.7
Ohio    2002  3.6
Nevada  2001  2.4
Nevada  2002  2.9
Nevada  2003  3.2

In [74]:
#series inded can be altered in place by assignment
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [75]:
obj.index

Index(['Bob', 'Steve', 'Jeff', 'Ryan'], dtype='object')

In [76]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [77]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [78]:
#DataFrame: A rectangular table of data and containing an added ordered, named collection of columns.
data : Dict = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
frame = pd.DataFrame(data)

In [79]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [80]:
#first five rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [81]:
#first n rows
frame.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [82]:
frame.head(n=3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [83]:
#is you specify a sequence of columns, then the DataFrame's columns will be in that order
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [84]:
pd.DataFrame(data, columns=['pop', 'year', 'state'])

   pop  year   state
0  1.5  2000    Ohio
1  1.7  2001    Ohio
2  3.6  2002    Ohio
3  2.4  2001  Nevada
4  2.9  2002  Nevada
5  3.2  2003  Nevada

In [85]:
#if you pass a column that is not contained in the dictionary, it will appear with missing values
#in the result
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [86]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [87]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [88]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [89]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [90]:
frame2['state'] is frame2.state

True

In [91]:
#retrievals by position
frame.loc[0]

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [92]:
frame.iloc[0]

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [99]:
#modify columns by assignment
frame['debt'] = 16.5

In [100]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2001  2.4  16.5
4  Nevada  2002  2.9  16.5
5  Nevada  2003  3.2  16.5

In [101]:
frame['debt'] = np.arange(6)

In [102]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5